tap "anomalyco/tap"
tap "caskformula/caskformula"
tap "homebrew/services"
tap "nocodb/nocodb"
brew "autoconf"
brew "openssl@3"
brew "bat"
brew "beancount-language-server"
brew "readline"
brew "bitwarden-cli"
brew "docker"
brew "docker-compose"
brew "fzf"
brew "gh"
brew "gmp"
brew "libyaml"
brew "mise"
brew "neovim"
brew "ollama", restart_service: :changed
brew "python@3.12"
brew "ripgrep"
brew "source-highlight"
brew "starship"
brew "zoxide"
brew "anomalyco/tap/opencode"
cask "bettertouchtool"
cask "claude"
cask "discord"
cask "fastmail"
cask "firefox"
cask "ghostty"
cask "github"
cask "insomnia"
cask "maccy"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "netnewswire"
cask "obsidian"
cask "pgadmin4"
cask "quicken"
cask "rectangle"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "zed"
cask "zoom"
vscode "anthropic.claude-code"
vscode "astral-sh.ty"
vscode "charliermarsh.ruff"
vscode "continue.continue"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-pull-request-github"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "lencerf.beancount"
vscode "mechatroner.rainbow-csv"
vscode "metaphore.kanagawa-vscode-color-theme"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "parisneo.toml-hilighter"
vscode "qwtel.sqlite-viewer"
vscode "rooveterinaryinc.roo-cline"
vscode "sqlfluff.vscode-sqlfluff"
vscode "tomoki1207.pdf"
vscode "yzhang.markdown-all-in-one"
go "cmd/go"
go "cmd/gofmt"
